000001 IDENTIFICATION DIVISION.
000002     PROGRAM-ID. IMC.
000003     AUTHOR. Mauricio Rodrigues
000004
000005 ENVIRONMENT DIVISION.
000006
000007 DATA DIVISION.
000008 WORKING-STORAGE SECTION.
000009 01  PESO    PIC 999.
000010 01  ALTURA  PIC 9V99.
000011 01  IMC     PIC ZZ9.99.
000012
000013 PROCEDURE DIVISION.
000014 MAIN.
000015*    RECEBENDO VALORES
000016     DISPLAY "Digite sua altura (em m):".
000017     ACCEPT ALTURA.
000018
000019     DISPLAY "Digite seu peso (em kg):".
000020     ACCEPT PESO.
000021     
000022*    CALCULANDO IMC
000023     COMPUTE IMC = PESO / (ALTURA ** 2).
000024
000025*    PRINTANDO RESULTADO
000026     DISPLAY "Seu IMC é " IMC.
000027
000028     STOP RUN.
000029
000030 END PROGRAM IMC.
