000001 IDENTIFICATION DIVISION.
000002     PROGRAM-ID. MEDIA-NOTAS.
000003     AUTHOR. Mauricio Rodrigues.
000004
000005 ENVIRONMENT DIVISION.
000006
000007 DATA DIVISION.
000008 WORKING-STORAGE SECTION.
000009 01  NOTA1         PIC 99V99.
000010 01  NOTA2         PIC 99V99.
000011 01  NOTA3         PIC 99V99.
000012 01  MEDIA-FINAL   PIC Z9.99.
000013
000014 PROCEDURE DIVISION.
000015 MAIN.
000016     DISPLAY "Digite o valor da primeira nota:".
000017     ACCEPT NOTA1.
000018     
000019     DISPLAY "Digite o valor da segunda nota:".
000020     ACCEPT NOTA2.
000021     
000022     DISPLAY "Digite o valor da terceira nota:".
000023     ACCEPT NOTA3.
000024
000025     COMPUTE MEDIA-FINAL = (NOTA1 + NOTA2 + NOTA3) / 3.
000026     
000027     DISPLAY "Sua média final ficou em " MEDIA-FINAL.
000028     
000029     STOP RUN.
000030 END PROGRAM MEDIA-NOTAS.
