000001 IDENTIFICATION DIVISION.
000002     PROGRAM-ID. HelloWorld.
000003     author. Mauricio Rodrigues.
000004
000005 ENVIRONMENT DIVISION.
000006 
000007 DATA DIVISION.
000008
000009 PROCEDURE DIVISION.
000010 MAIN.
000011     DISPLAY "Hello World!".
000012*    Exemplo de Comentário
000013
000014     STOP RUN.
000015 END PROGRAM HelloWorld.
